<?php

namespace App\Common;

class CommonMsg
{
    // ----------------------------------- 共通メッセージ START ---------------------------------------
    const MSG_ID_000001 = "登録完了しました。";
    const MSG_ID_000002 = "編集完了しました。";
    const MSG_ID_000003 = "削除完了しました。";
    const MSG_ID_000004 = "既に登録されています。";
    const MSG_ID_000005 = "既に削除されています。";
    const MSG_ID_000006 = "該当データが存在しません。";
    const MSG_ID_000007 = "確定完了しました。";
    const MSG_ID_000008 = "承認しました。";
    const MSG_ID_000009 = "更新完了しました。";
    const MSG_ID_000100 = "検索処理でエラーが発生しました。";
    const MSG_ID_000101 = "登録処理でエラーが発生しました。";
    const MSG_ID_000102 = "更新処理でエラーが発生しました。";
    const MSG_ID_000103 = "削除処理でエラーが発生しました。";
    const MSG_ID_000104 = "データベースに接続がされていません。";
    const MSG_ID_000105 = "リクエストパラメータが不正です。";
    const MSG_ID_000106 = "ファイルパラメータ文字列が正しくありません。";
    const MSG_ID_000200 = "桁数が不正です。";
    const MSG_ID_000201 = "半角数字のみで入力してください。";
    const MSG_ID_000202 = "半角英字のみで入力してください。";
    const MSG_ID_000203 = "半角英数字のみで入力してください。";
    const MSG_ID_000204 = "全角のみで入力してください。";
    const MSG_ID_000205 = "必須項目が未選択(未入力)です。";
    const MSG_ID_000300 = "XXより大きい値を選択(入力)してください";
    const MSG_ID_000301 = "XXより小さい値を選択(入力)してください";
    const MSG_ID_000302 = "XX以上の値を選択(入力)してください";
    const MSG_ID_000303 = "XX以下の値を選択(入力)してください";
    const MSG_ID_000304 = "XXより大きく、ZZより小さい値を選択(入力)してください";
    const MSG_ID_000305 = "XX以上、ZZ以下の値を選択(入力)してください";
    const MSG_ID_000400 = "メールアドレスの形式で入力してください。(xxxx@example.com)";
    const MSG_ID_000401 = "1つ以上選択してください。";
    const MSG_ID_000500 = "アクセス権がないため操作できません。";
    const MSG_ID_000600 = "ログインIDが不正です。";
    const MSG_ID_000601 = "ログインパスワードが不正です。";
    const MSG_ID_000602 = "ログインIDまたはログインパスワードが誤っています。";
    const MSG_ID_000700 = "ファイルが存在しません。";
    const MSG_ID_000800 = "ご覧になりたいページへのアクセスは拒否されました。";
    const MSG_ID_000801 = "ご指定のページが見つかりません。";
    const MSG_ID_000802 = "ご指定のページが見つかりません。";
    const MSG_ID_000803 = "メールが送信できませんでした。";
    const MSG_ID_000804 = "ファイルパラメータ文字列が正しくありません。";

    // ----------------------------------- 共通メッセージ END -----------------------------------------

    // ----------------------------------- カスタムメッセージ START -----------------------------------
    const CUS_MSG_ID_000001 = "";
    // ----------------------------------- カスタムメッセージ END -------------------------------------
}